app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM "pages"

  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
      raise ActiveRecord::RecordNotFound, "Page not found" if @page.nil?
    else
      @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."permalink" = 'about') LIMIT 1
SELECT * FROM "pages" WHERE ("pages"."id" = 1)

  def create
    @page = Page.new(params[:page])
    if @page.save
---
INSERT INTO "pages" ("name", "permalink", "created_at", "updated_at", "content") VALUES('About Us', 'about', '2009-11-27 10:00:35', '2009-11-27 10:00:35', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.')

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)
UPDATE "pages" SET "updated_at" = '2009-11-27 10:06:49', "content" = '[code]Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,[/code] quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.' WHERE "id" = 1