app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 4)
---
  def index
    @users = User.find(:all)

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "email") VALUES('', '10954e7a1ed44583d1801165932ef26d5445843b', '2009-11-25 07:56:20', NULL, 'bae91af9667657f55a07271e4fded7264cedec68', NULL, '2009-11-25 07:56:20', 'b4572f40647388dd4d6cd5cff80586cd595363c9', NULL, 'ellis', 'eberner@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."activation_code" = 'b4572f40647388dd4d6cd5cff80586cd595363c9') LIMIT 1
---
  def activate
    current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])

SELECT * FROM "users" WHERE ("users"."reset_code" = '907ac35c965112332080f901ac17a7026ab17818') LIMIT 1
UPDATE "users" SET "updated_at" = '2009-11-27 09:32:54', "reset_code" = NULL, "password_hash" = '8c1c95ea505782132691db7d842b8fab3223683a', "password_salt" = '44dc0aa4b1d6fec626db8c581c896b4ff4ac52a0' WHERE "id" = 5
---
  def reset
    @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?
    if request.post?
      if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])

SELECT * FROM "users" WHERE ("users"."email" = 'test3@test3.com') LIMIT 1
---
  def forgot
    if request.post?
      user = User.find_by_email(params[:user][:email])